---
title: AdvancedGlazing
classe: Autodesk.Revit.DB.Visual.AdvancedGlazing
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# AdvancedGlazing

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String GlazingBackfaceCulling { get; }` | `AdvancedGlazing.GlazingBackfaceCulling` | String |
| `String GlazingF0 { get; }` | `AdvancedGlazing.GlazingF0` | String |
| `String GlazingTransmissionColor { get; }` | `AdvancedGlazing.GlazingTransmissionColor` | String |
| `String GlazingTransmissionRoughness { get; }` | `AdvancedGlazing.GlazingTransmissionRoughness` | String |
| `String SurfaceAlbedo { get; }` | `AdvancedGlazing.SurfaceAlbedo` | String |
| `String SurfaceAnisotropy { get; }` | `AdvancedGlazing.SurfaceAnisotropy` | String |
| `String SurfaceCutout { get; }` | `AdvancedGlazing.SurfaceCutout` | String |
| `String SurfaceNdfType { get; }` | `AdvancedGlazing.SurfaceNdfType` | String |
| `String SurfaceNormal { get; }` | `AdvancedGlazing.SurfaceNormal` | String |
| `String SurfaceRotation { get; }` | `AdvancedGlazing.SurfaceRotation` | String |
| `String SurfaceRoughness { get; }` | `AdvancedGlazing.SurfaceRoughness` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```